mqhc112031/STM32F103ZET6-smart-trash-can/STM32_CODE/SYSTEM/usart/usart.h
#ifndef __USART_H
#define __USART_H
#include "stdio.h"	
#include "sys.h" 
#include "stm32f10x.h"
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//ALIENTEK STM32开发板
//串口1初始化		   
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//修改日期:2012/8/18
//版本：V1.5
//版权所有，盗版必究。
//Copyright(C) 广州市星翼电子科技有限公司 2009-2019
//All rights reserved
//********************************************************************************
//V1.3修改说明 
//支持适应不同频率下的串口波特率设置.
//加入了对printf的支持
//增加了串口接收命令功能.
//修正了printf第一个字符丢失的bug
//V1.4修改说明
//1,修改串口初始化IO的bug
//2,修改了USART_RX_STA,使得串口最大接收字节数为2的14次方
//3,增加了USART_REC_LEN,用于定义串口最大允许接收的字节数(不大于2的14次方)
//4,修改了EN_USART1_RX的使能方式
//V1.5修改说明
//1,增加了对UCOSII的支持
#define USART_REC_LEN     400  	//定义最大接收字节数 400 
#define EN_USART1_RX 			1		//使能（1）/禁止（0）串口1接收
#define USART3_REC_LEN 100
#define USART_DEBUG		USART1		//调试打印所使用的串口组	  	
extern u8  USART_RX_BUF[USART_REC_LEN]; //接收缓冲,最大USART_REC_LEN个字节.末字节为换行符 
extern u16 USART_RX_STA;         		//接收状态标记	

extern u8 USART3_RX_BUF[USART3_REC_LEN]; // 串口3数据缓冲区
void Usart_SendString(USART_TypeDef *USARTx, unsigned char *str, unsigned short len);

void UsartPrintf(USART_TypeDef *USARTx, char *fmt,...);
//如果想串口中断接收，请不要注释以下宏定义
void Usart1_Init(unsigned int baud);
void Usart2_Init(unsigned int baud);

void usart3_init(u32 band);//串口2 初始化函数
void usart3_SendStringByLen(unsigned char * data,u8 len);//
void usart3_SendString(unsigned char * data);
u16 usart3_receive(u32 time);
void usart3_Send_Data(u8 *buf,u16 len);
void USART3SendByte(unsigned char SendData);
void getResultTemp(void);

extern char  USART4_RX_BUF[USART_REC_LEN]; //接收缓冲,最大USART_REC_LEN个字节.末字节为换行符   
extern u16 USART4_RX_STA; 
void Uart4_Init(u32 bound);
void UART4_IRQHandler(void);
#endif


